FemDesign.Shells.SlabPart
slab_part_type

FemDesign.Shells.SlabPart.ShellEccentricity
Get ShellEccentricity

FemDesign.Shells.SlabPart.ShellOrthotropy
Get ShellOrthotropy

FemDesign.Shells.SlabPart.#ctor
Parameterless constructor for serialization.

FemDesign.Shells.SlabPart.#ctor(System.String,FemDesign.Geometry.Region,System.Collections.Generic.List{FemDesign.Shells.Thickness},FemDesign.Materials.Material,FemDesign.Shells.ShellEccentricity,FemDesign.Shells.ShellOrthotropy)
Construct SlabPart.

FemDesign.Shells.SlabPart.Define(System.String,FemDesign.Geometry.Region,System.Collections.Generic.List{FemDesign.Shells.Thickness},FemDesign.Materials.Material,FemDesign.Shells.EdgeConnection,FemDesign.Shells.ShellEccentricity,FemDesign.Shells.ShellOrthotropy)
Construct SlabPart with EdgeConnections.

FemDesign.Shells.SlabPart.GetEdgeConnections
Get EdgeConnections. Used for Deconstruct methods and when redefining EdgeConnections on existing slab.